InformationRegisters/ИсторияЦенИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЦенИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastPriceType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИмпортДанныхБрокера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИмпортДанныхБрокера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expectedYield</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPricePt</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currentPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>quantityLots</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ticker</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>instrumentUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвечиИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвечиИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Close</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакЗавершенностиСвечи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Таймфрейм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТаймфреймыСвечей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<BasedOn>
				<xr:Item>Document.ВводНачальныхОстатков</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ИнтеграцияTInvestРыночныеДанные/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// ЗагрузитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей)
// Получает последние цены по инструментам через метод GetLastPrices и записывает их в регистр сведений ТекущиеЦены.
// Параметры:
// Инструменты -- таблица значений с колонкой UID; если не задана, список инструментов определяется по текущим остаткам регистра ПозицииИнструментов
// КоличествоЗаписей -- выходной параметр, количество записанных цен
// Результат:
// выполняется запись данных в регистр ТекущиеЦены
// Особенности:
// отбираются только инструменты с заполненным UID
// инструмент сопоставляется по UID
// если инструмент не найден, выводится сообщение пользователю
Процедура ЗагрузитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей) Экспорт
	
	lastPrices = ИнтеграцияTInvestAPI.ПолучитьПоследниеЦеныПоИнструментам(Инструменты = Неопределено, КоличествоЗаписей);
	
	Отбор = Новый Структура("UID");
	Источник = Справочники.ИсточникиДанных.ТИнвест;
	
	КоличествоЗаписей = 0;
	Для Каждого СтруктураИнструмента Из lastPrices Цикл
		
		Если СтруктураИнструмента.lastPriceType = "LAST_PRICE_UNSPECIFIED" Тогда
			Продолжить;
		КонецЕсли;
		Если Не СтруктураИнструмента.Свойство("time") Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ИсторияЦенИнструментов.СоздатьМенеджерЗаписи();
		
		Отбор.UID = СтруктураИнструмента.instrumentUid;
		СтрокиИнструмента = Инструменты.НайтиСтроки(Отбор);
		Если СтрокиИнструмента.Количество() = 1 Тогда
			Инструмент = СтрокиИнструмента[0].Ссылка;
		Иначе
			Сообщить("Не найден инструмент по uid " + СтруктураИнструмента.instrumentUid);
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи.Период = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(Лев(СтруктураИнструмента.time, 19));
		МенеджерЗаписи.Инструмент = Инструмент;
		МенеджерЗаписи.Цена = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СтруктураИнструмента.price);
		МенеджерЗаписи.lastPriceType = СтруктураИнструмента.lastPriceType;
		МенеджерЗаписи.Источник = Источник;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// ЗагрузитьПортфельПоСчету(Счет, currency = Неопределено, ПрочитатьГотовыеДанные = Ложь, СоздатьВводОстатков = Ложь)
// Получает портфель по счёту через GetPortfolio, сохраняет импортированные данные в регистр ИмпортДанныхБрокера и при необходимости создаёт документ ВводНачальныхОстатков.
// Параметры:
// Счет -- счёт в одном из допустимых представлений:
// ссылка на справочник Счета
// строковый AccountId
// строка выборки запроса
// currency -- валюта запроса, в текущей реализации фактически игнорируется, жёстко используется "RUB"
// ПрочитатьГотовыеДанные -- читать ранее сохранённые данные из временного хранилища
// СоздатьВводОстатков -- создавать документ ВводНачальныхОстатков
// Результат:
// записывает позиции в регистр ИмпортДанныхБрокера
// опционально создаёт документ ВводНачальныхОстатков
// Особенности:
// данные сервиса дополнительно сохраняются в справочник ВременноеХранениеДанных
// инструмент определяется по instrumentUid
// Замечания:
// метод сочетает получение, кэширование, импорт и создание документа
// параметр currency сейчас реализован неверно, так как не используется по значению
Процедура ЗагрузитьПортфельПоСчету(Счет, currency = "RUB", ПрочитатьГотовыеДанные = Ложь, СоздатьВводОстатков = Ложь) Экспорт
	
	ДанныеСервиса = ИнтеграцияTInvestAPI.TInvest_ПолучитьПортфельПоСчету(Счет, currency, ПрочитатьГотовыеДанные);
	positions = ДанныеСервиса.positions;
	СчетСсылка = ДанныеСервиса.СчетСсылка;
	
	Если Не ЗначениеЗаполнено(positions) Тогда
		Возврат;
	КонецЕсли;
	
	Источник = Справочники.ИсточникиДанных.ТИнвест;
	КоличествоЗаписей = 0;
	Для Каждого position Из positions Цикл
		
		МенеджерЗаписи = РегистрыСведений.ИмпортДанныхБрокера.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(position.instrumentUid);
		МенеджерЗаписи.instrumentUid = position.instrumentUid;
		МенеджерЗаписи.averagePositionPrice = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(position.averagePositionPrice);
		МенеджерЗаписи.currency = position.averagePositionPrice.currency;
		МенеджерЗаписи.averagePositionPricePt = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(position.averagePositionPricePt);
		МенеджерЗаписи.currency1 = position.averagePositionPrice.currency;
		МенеджерЗаписи.expectedYield = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(position.expectedYield);
		МенеджерЗаписи.quantityLots = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(position.quantityLots);
		МенеджерЗаписи.ticker = position.ticker;
		МенеджерЗаписи.Источник = Источник;
		МенеджерЗаписи.Счет = СчетСсылка;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;

	КонецЦикла;
	
	Если СоздатьВводОстатков Тогда
		ДокВвод = Документы.ВводНачальныхОстатков.СоздатьДокумент();
		ДокВвод.Дата = МенеджерЗаписи.Период;
		ДанныеЗаполнения = Новый Структура("Дата, Счет", ТекущаяДатаСеанса(), СчетСсылка);
		ДокВвод.Заполнить(ДанныеЗаполнения);
		Попытка
			ДокВвод.Записать();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1, количество позиций: %2", ДокВвод.Ссылка, КоличествоЗаписей), ДокВвод.Ссылка);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Загружены данные по счету %1, количество позиций: %2", СчетСсылка, КоличествоЗаписей));
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьПортфельПоСчету

// Загружает свечи по инструменту и записывает их в регистр сведений СвечиИнструментов.
// Параметры:
//  Инструмент      - СправочникСсылка.Инструменты
//  ДатаНачала      - Дата
//  ДатаОкончания   - Дата
//  Таймфрейм       - ПеречислениеСсылка.ТаймфреймыСвечей
// Возвращает:
//  Число - количество записанных/обновленных свечей
Функция ЗагрузитьСвечиПоИнструменту(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм) Экспорт
    
    ПроверитьПараметрыЗагрузкиСвечей(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм);
    
    ИдентификаторИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "UID");
    ИнтервалAPI = Перечисления.ТаймфреймыСвечей.ПолучитьИнтервалСвечейAPI(Таймфрейм);
    
    МассивСвечейAPI = ИнтеграцияTInvestAPI.ПолучитьСвечи(
        ИдентификаторИнструмента,
        ДатаНачала,
        ДатаОкончания,
        ИнтервалAPI
    );
    
    Если МассивСвечейAPI = Неопределено Или МассивСвечейAPI.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;
    
    ТаблицаСвечей = ПреобразоватьСвечиAPIВТаблицу(Инструмент, Таймфрейм, МассивСвечейAPI);
    КоличествоЗаписей = ЗаписатьСвечиВРегистр(ТаблицаСвечей);
    
    Возврат КоличествоЗаписей;
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ЗаписатьОшибкуВЖурналРегистрации(Комментарий, ИсточникДанных)
//	
//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с API'", ОбщегоНазначения.КодОсновногоЯзыка()),
//		УровеньЖурналаРегистрации.Ошибка, , ИсточникДанных, Комментарий);
//	
//КонецПроцедуры

//Функция ТекстОшибки(ТекстОшибки)
//	
//	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
//		Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Подробности см. в журнале регистрации.'");
//	КонецЕсли;
//	
//	Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Обратитесь к администратору.'");
//	
//КонецФункции

Процедура ПроверитьПараметрыЗагрузкиСвечей(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм)
    
    Если Инструмент = Неопределено Тогда
        ВызватьИсключение "Не задан инструмент.";
    КонецЕсли;
    
    Если ДатаНачала = Неопределено Тогда
        ВызватьИсключение "Не задана дата начала.";
    КонецЕсли;
    
    Если ДатаОкончания = Неопределено Тогда
        ВызватьИсключение "Не задана дата окончания.";
    КонецЕсли;
    
    Если ДатаНачала > ДатаОкончания Тогда
        ВызватьИсключение "Дата начала больше даты окончания.";
    КонецЕсли;
    
    Если Таймфрейм = Неопределено Тогда
        ВызватьИсключение "Не задан таймфрейм.";
    КонецЕсли;
    
КонецПроцедуры

//Функция ПолучитьИдентификаторИнструментаДляAPI(Инструмент)
//    
//    // Подстрой под свои реквизиты справочника.
//    // Предпочтительно использовать UID, а не FIGI.
//    
//    Если ЗначениеЗаполнено(Инструмент.UID) Тогда
//        Возврат Инструмент.UID;
//    КонецЕсли;
//    
//    Если ЗначениеЗаполнено(Инструмент.FIGI) Тогда
//        Возврат Инструмент.FIGI;
//    КонецЕсли;
//    
//    ВызватьИсключение "У инструмента не заполнен UID/FIGI для вызова API.";
//    
//КонецФункции

Функция ПреобразоватьСвечиAPIВТаблицу(Инструмент, Таймфрейм, МассивСвечейAPI)
    
    Таблица = Новый ТаблицаЗначений;
    Таблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
    Таблица.Колонки.Добавить("Инструмент");
    Таблица.Колонки.Добавить("Таймфрейм");
    Таблица.Колонки.Добавить("Open", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("High", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Low", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Close", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Volume", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
    Таблица.Колонки.Добавить("Источник");
    
    Для Каждого СвечаAPI Из МассивСвечейAPI Цикл
        
        СтрокаТаблицы = Таблица.Добавить();
        СтрокаТаблицы.Период = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(СвечаAPI.time);
        СтрокаТаблицы.Инструмент = Инструмент;
        СтрокаТаблицы.Таймфрейм = Таймфрейм;
        СтрокаТаблицы.Open = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.open);
        СтрокаТаблицы.High = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.high);
        СтрокаТаблицы.Low = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.low);
        СтрокаТаблицы.Close = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.close);
        СтрокаТаблицы.Volume = ?(СвечаAPI.Свойство("volume"), СвечаAPI.volume, 0);
        СтрокаТаблицы.Источник = Справочники.ИсточникиДанных.ТИнвест;
        
    КонецЦикла;
    
    Возврат Таблица;
    
КонецФункции

Функция ЗаписатьСвечиВРегистр(ТаблицаСвечей)
    
    Если ТаблицаСвечей.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;
    
    Инструмент = ТаблицаСвечей[0].Инструмент;
    Таймфрейм = ТаблицаСвечей[0].Таймфрейм;
    
    МинПериод = ТаблицаСвечей[0].Период;
    МаксПериод = ТаблицаСвечей[0].Период;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        Если СтрокаСвечи.Период < МинПериод Тогда
            МинПериод = СтрокаСвечи.Период;
        КонецЕсли;
        Если СтрокаСвечи.Период > МаксПериод Тогда
            МаксПериод = СтрокаСвечи.Период;
        КонецЕсли;
    КонецЦикла;
    
    СуществующиеСвечи = ПолучитьСуществующиеСвечи(Инструмент, Таймфрейм, МинПериод, МаксПериод);
    ИндексСуществующих = ПостроитьИндексСвечей(СуществующиеСвечи);
    
    НаборЗаписей = РегистрыСведений.СвечиИнструментов.СоздатьНаборЗаписей();
    КоличествоИзменений = 0;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        
        Ключ = ПолучитьКлючСвечи(СтрокаСвечи.Период, СтрокаСвечи.Инструмент, СтрокаСвечи.Таймфрейм);
		
		СуществующаяСтрока = ИндексСуществующих.Получить(Ключ);
		Если СуществующаяСтрока <> Неопределено Тогда
		//Если ИндексСуществующих.Свойство(Ключ, СуществующаяСтрока) Тогда
		    
		    Если СвечаИзменилась(СуществующаяСтрока, СтрокаСвечи) Тогда
		        Запись = НаборЗаписей.Добавить();
		        Запись.Период = СтрокаСвечи.Период;
		        Запись.Инструмент = СтрокаСвечи.Инструмент;
		        Запись.Таймфрейм = СтрокаСвечи.Таймфрейм;
		        Запись.Open = СтрокаСвечи.Open;
		        Запись.High = СтрокаСвечи.High;
		        Запись.Low = СтрокаСвечи.Low;
		        Запись.Close = СтрокаСвечи.Close;
		        Запись.Volume = СтрокаСвечи.Volume;
		        Запись.Источник = СтрокаСвечи.Источник;
		        КоличествоИзменений = КоличествоИзменений + 1;
		    КонецЕсли;
		    
		Иначе
		    
		    Запись = НаборЗаписей.Добавить();
		    Запись.Период = СтрокаСвечи.Период;
		    Запись.Инструмент = СтрокаСвечи.Инструмент;
		    Запись.Таймфрейм = СтрокаСвечи.Таймфрейм;
		    Запись.Open = СтрокаСвечи.Open;
		    Запись.High = СтрокаСвечи.High;
		    Запись.Low = СтрокаСвечи.Low;
		    Запись.Close = СтрокаСвечи.Close;
		    Запись.Volume = СтрокаСвечи.Volume;
		    Запись.Источник = СтрокаСвечи.Источник;
		    КоличествоИзменений = КоличествоИзменений + 1;
		    
		КонецЕсли;
        
    КонецЦикла;
    
    Если КоличествоИзменений > 0 Тогда
        НаборЗаписей.Записать();
    КонецЕсли;
    
    Возврат КоличествоИзменений;
    
КонецФункции

Функция ПолучитьСуществующиеСвечи(Инструмент, Таймфрейм, ДатаНачала, ДатаОкончания)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Свечи.Период КАК Период,
    |   Свечи.Инструмент КАК Инструмент,
    |   Свечи.Таймфрейм КАК Таймфрейм,
    |   Свечи.Open КАК Open,
    |   Свечи.High КАК High,
    |   Свечи.Low КАК Low,
    |   Свечи.Close КАК Close,
    |   Свечи.Volume КАК Volume,
    |   Свечи.Источник КАК Источник
    |ИЗ
    |   РегистрСведений.СвечиИнструментов КАК Свечи
    |ГДЕ
    |   Свечи.Инструмент = &Инструмент
    |   И Свечи.Таймфрейм = &Таймфрейм
    |   И Свечи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
    
    Запрос.УстановитьПараметр("Инструмент", Инструмент);
    Запрос.УстановитьПараметр("Таймфрейм", Таймфрейм);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

Функция ПостроитьИндексСвечей(ТаблицаСвечей)
    
    Индекс = Новый Соответствие;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        Ключ = ПолучитьКлючСвечи(СтрокаСвечи.Период, СтрокаСвечи.Инструмент, СтрокаСвечи.Таймфрейм);
        Индекс.Вставить(Ключ, СтрокаСвечи);
    КонецЦикла;
    
    Возврат Индекс;
    
КонецФункции

Функция ПолучитьКлючСвечи(Период, Инструмент, Таймфрейм)
    Возврат Формат(Период, "ДФ=yyyyMMddHHmmss") + "|" + Строка(Инструмент) + "|" + Строка(Таймфрейм);
КонецФункции

Функция СвечаИзменилась(СуществующаяСтрока, НоваяСтрока)
    
    Возврат
        СуществующаяСтрока.Open <> НоваяСтрока.Open
        Или СуществующаяСтрока.High <> НоваяСтрока.High
        Или СуществующаяСтрока.Low <> НоваяСтрока.Low
        Или СуществующаяСтрока.Close <> НоваяСтрока.Close
        Или СуществующаяСтрока.Volume <> НоваяСтрока.Volume
        Или СуществующаяСтрока.Источник <> НоваяСтрока.Источник;
    
КонецФункции
	
#КонецОбласти
